In [9]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import sqlite3

In [10]:
conn = sqlite3.connect('database.sqlite')

In [11]:
cur = conn.cursor()

In [14]:
df = pd.read_sql_query("select * from League;", conn)

In [15]:
df

       id  country_id                      name
0       1           1    Belgium Jupiler League
1    1729        1729    England Premier League
2    4769        4769            France Ligue 1
3    7809        7809     Germany 1. Bundesliga
4   10257       10257             Italy Serie A
5   13274       13274    Netherlands Eredivisie
6   15722       15722        Poland Ekstraklasa
7   17642       17642  Portugal Liga ZON Sagres
8   19694       19694   Scotland Premier League
9   21518       21518           Spain LIGA BBVA
10  24558       24558  Switzerland Super League